**`teams/nomis/rhel_6_10_weblogic_appserver_10_3`** terraform plan on `push` event [#434](${url})

```

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement
+/- create replacement and then destroy

Terraform will perform the following actions:

  # module.imagebuilder["rhel_6_10_weblogic_appserver_10_3"].aws_imagebuilder_component.this["../components/rhel_6_10_weblogic_appserver_10_3/weblogic.yml"] must be replaced
+/- resource "aws_imagebuilder_component" "this" {
      ~ arn                   = "arn:aws:imagebuilder:eu-west-2:374269020027:component/weblogic/1.1.6/1" -> (known after apply)
      ~ data                  = <<-EOT # forces replacement
            ---
            name: Weblogic
            description: Weblogic provisioner component.
            schemaVersion: 1.0
            parameters:
              - Version:
                  type: string
          -       default: "1.1.6"
          +       default: "1.1.7"
                  description: Component version (update this each time the file changes)
              - Platform:
                  type: string
                  default: "Linux"
                  description: Platform.
            phases:
              - name: build
                steps:
                  - name: UpdateOS
                    action: UpdateOS
                  - name: WeblogicInstall
                    action: ExecuteBash
                    inputs:
                      commands:
                        - |
                          set -e
            
                          provision_server() {
                              groupadd oinstall -g501
                              useradd oracle -u501 -g501
            
                              curl "https://awscli.amazonaws.com/awscli-exe-linux-x86_64.zip" -o "awscliv2.zip"
                              unzip awscliv2.zip
                              ./aws/install -i /usr/aws-cli -b /usr/bin
            
                              mkdir /u01
                              mkfs -t ext4 /dev/xvdb
                              mount /dev/xvdb /u01
                              fallocate -l 1G /swapfile
                              dd if=/dev/zero of=/swapfile bs=1024 count=1048576
                              chmod 600 /swapfile
                              mkswap /swapfile
                              swapon /swapfile
                              mkdir -p /var/opt/oracle/
                              chown oracle:oinstall /var/opt/oracle/
            
                              echo "/swapfile               swap                    swap    defaults        0 0" >> /etc/fstab
                              OUTPUT="$(blkid -s UUID -o value /dev/xvdb)"
                              echo "UUID="$OUTPUT" /u01                     ext4    defaults        0 0" >> /etc/fstab
            
                              yum install -y libaio-devel compat-libstdc++-33 libstdc++-devel gcc gcc-c++ ksh compat-libcap1-1.10 glibc glibc-devel.i686 compat-libstdc++-33.i686  libstdc++.i686 libXext.i686 libXtst.i686 openmotif openmotif22
            
                              mkdir -p /u01/software
                              aws s3api get-object --bucket ec2-image-builder-nomis20220314103938567000000001 --key weblogic-software/jdk-6u43-linux-x64-rpm.bin jdk-6u43-linux-x64-rpm.bin
                              aws s3api get-object --bucket ec2-image-builder-nomis20220314103938567000000001 --key weblogic-software/software.tar /u01/software.tar
                              aws s3api get-object --bucket ec2-image-builder-nomis20220314103938567000000001 --key weblogic-software/tag.tar /u01/tag.tar
            
                              chmod +x jdk-6u43-linux-x64-rpm.bin
                              yes | ./jdk-6u43-linux-x64-rpm.bin
            
                              chown -R oracle:oinstall /u01/
            
                              tar -xf /u01/software.tar --directory=/u01
                              tar -xf /u01/tag.tar --directory=/u01
            
                              java -d64  -Xmx1024m -jar /u01/software/weblogic/wls1036_generic.jar -mode=silent -silent_xml=/u01/software/weblogic/silent.xml -Djava.io.tmpdir=/u01/software
            
                              export MW_HOME=/u01/app/oracle/Middleware
                              export WL_HOME='/u01/app/oracle/Middleware/wlserver_10.3'
            
                              mkdir ${MW_HOME}/utils/bsu/cache_dir
                              cp -pr /u01/software/weblogic_patch/p21984589_1036_Generic.zip ${MW_HOME}/utils/bsu/cache_dir
            
                              cd ${MW_HOME}/utils/bsu/cache_dir
                              unzip p21984589_1036_Generic.zip
                              cd ${MW_HOME}/utils/bsu/
                              sed -i 's/-Xms256m -Xmx512m/-Xms4096m -Xmx4096m/g' bsu.sh
                              ./bsu.sh -install -patch_download_dir=$MW_HOME/utils/bsu/cache_dir -patchlist=S8C2 -prod_dir=$WL_HOME -verbose
                              sed -i '/^export PATH/a JAVA_OPTIONS="${JAVA_OPTIONS} -Djava.net.preferIPv4Stack=true"\nMEM_ARGS="${MEM_ARGS} -Djava.security.egd=file:/dev/./urandom"' /u01/app/oracle/Middleware/wlserver_10.3/server/bin/startNodeManager.sh
            
                              mkdir -p ${MW_HOME}/forms_home
                              yes | cp -p /u01/software/bash_profile /home/oracle/.bash_profile
                              chmod +x /home/oracle/.bash_profile
                              chown -R oracle:oinstall /u01/
                              source /home/oracle/.bash_profile
                              touch /var/opt/oracle/oraInst.loc
                              echo "inventory_loc=/u01/app/oracle/oraInventory
                              inst_group=oinstall" > /var/opt/oracle/oraInst.loc
                              cd /u01/software/forms
                              tar xf Disk1.tar
                              tar xf Disk2.tar
                              tar xf Disk3.tar
                              tar xf Disk4.tar
            
                              # Weblogic service
                              cp /u01/software/weblogic/service/nomis_weblogic /etc/init.d/
            
                              runuser -l oracle -c 'bash /u01/software/forms/Disk1/runInstaller -silent -responseFile /u01/software/forms/install_only.rsp -invPtrLoc /var/opt/oracle/oraInst.loc'
                              # Wait for all oracle subprocesses to finish
                              tail --pid=$(pgrep -u oracle) -f /dev/null
            
                              rm /u01/software.tar /u01/tag.tar
                              echo "~~~ Downloading weblogic setup script ~~~"
                              aws s3api get-object --bucket ec2-image-builder-nomis20220314103938567000000001 --key weblogic-software/weblogic-setup.sh /u01/software/weblogic/weblogic-setup.sh
                              echo "~~~ Downloaded weblogic setup script ~~~"
                              chown oracle:oinstall /u01/software/weblogic/weblogic-setup.sh
                              chmod +x /u01/software/weblogic/weblogic-setup.sh
            
                              # logfiles cleanout
            
                              cat /dev/null > /u01/tag/tmp/HotPage.log
                              cat /dev/null > /u01/tag/tmp/web.log
                              cat /dev/null > /u01/tag/autologoff/autologoff.log
            
                              rm /u01/tag/autologoff/autologoff.log*
                          }
            
                          main() {
                              provision_server
                          }
            
                          main
        EOT
      ~ date_created          = "2022-09-12T16:43:00.895Z" -> (known after apply)
      ~ encrypted             = true -> (known after apply)
      ~ id                    = "arn:aws:imagebuilder:eu-west-2:374269020027:component/weblogic/1.1.6/1" -> (known after apply)
        name                  = "Weblogic"
      ~ owner                 = "374269020027" -> (known after apply)
      - supported_os_versions = [] -> null
      ~ tags                  = {
          ~ "Weblogic-version"             = "1.1.6" -> "1.1.7"
          - "github-branch"                = "main" -> null
          ~ "image-recipe"                 = "nomis_rhel_6_10_weblogic_appserver_10_3/0.0.2" -> "nomis_rhel_6_10_weblogic_appserver_10_3/0.0.3"
          ~ "infrastructure-configuration" = "nomis_rhel_6_10_weblogic_appserver_10_3/0.0.2" -> "nomis_rhel_6_10_weblogic_appserver_10_3/0.0.3"
            # (10 unchanged elements hidden)
        }
      ~ tags_all              = {
          ~ "Weblogic-version"             = "1.1.6" -> "1.1.7"
          - "github-branch"                = "main" -> null
          ~ "image-recipe"                 = "nomis_rhel_6_10_weblogic_appserver_10_3/0.0.2" -> "nomis_rhel_6_10_weblogic_appserver_10_3/0.0.3"
          ~ "infrastructure-configuration" = "nomis_rhel_6_10_weblogic_appserver_10_3/0.0.2" -> "nomis_rhel_6_10_weblogic_appserver_10_3/0.0.3"
            # (10 unchanged elements hidden)
        }
      ~ type                  = "BUILD" -> (known after apply)
      ~ version               = "1.1.6" -> "1.1.7" # forces replacement
        # (3 unchanged attributes hidden)
    }

  # module.imagebuilder["rhel_6_10_weblogic_appserver_10_3"].aws_imagebuilder_distribution_configuration.this will be updated in-place
  ~ resource "aws_imagebuilder_distribution_configuration" "this" {
        id           = "arn:aws:imagebuilder:eu-west-2:374269020027:distribution-configuration/nomis-rhel-6-10-weblogic-appserver-10-3"
        name         = "nomis_rhel_6_10_weblogic_appserver_10_3"
      ~ tags         = {
          ~ "Weblogic-version"             = "1.1.6" -> "1.1.7"
          - "github-branch"                = "main" -> null
          ~ "image-recipe"                 = "nomis_rhel_6_10_weblogic_appserver_10_3/0.0.2" -> "nomis_rhel_6_10_weblogic_appserver_10_3/0.0.3"
          ~ "infrastructure-configuration" = "nomis_rhel_6_10_weblogic_appserver_10_3/0.0.2" -> "nomis_rhel_6_10_weblogic_appserver_10_3/0.0.3"
            # (10 unchanged elements hidden)
        }
      ~ tags_all     = {
          ~ "Weblogic-version"             = "1.1.6" -> "1.1.7"
          - "github-branch"                = "main" -> null
          ~ "image-recipe"                 = "nomis_rhel_6_10_weblogic_appserver_10_3/0.0.2" -> "nomis_rhel_6_10_weblogic_appserver_10_3/0.0.3"
          ~ "infrastructure-configuration" = "nomis_rhel_6_10_weblogic_appserver_10_3/0.0.2" -> "nomis_rhel_6_10_weblogic_appserver_10_3/0.0.3"
            # (10 unchanged elements hidden)
        }
        # (4 unchanged attributes hidden)

      ~ distribution {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
    }

  # module.imagebuilder["rhel_6_10_weblogic_appserver_10_3"].aws_imagebuilder_image_pipeline.this must be replaced
-/+ resource "aws_imagebuilder_image_pipeline" "this" {
      ~ arn                              = "arn:aws:imagebuilder:eu-west-2:374269020027:image-pipeline/nomis-rhel-6-10-weblogic-appserver-10-3" -> (known after apply)
      ~ date_created                     = "2022-09-13T08:08:21.539Z" -> (known after apply)
      + date_last_run                    = (known after apply)
      ~ date_next_run                    = "2022-10-02T00:00:00.000Z" -> (known after apply)
      ~ date_updated                     = "2022-09-13T08:08:21.539Z" -> (known after apply)
      ~ id                               = "arn:aws:imagebuilder:eu-west-2:374269020027:image-pipeline/nomis-rhel-6-10-weblogic-appserver-10-3" -> (known after apply)
      ~ image_recipe_arn                 = "arn:aws:imagebuilder:eu-west-2:374269020027:image-recipe/nomis-rhel-6-10-weblogic-appserver-10-3/0.0.2" -> (known after apply) # forces replacement
      ~ infrastructure_configuration_arn = "arn:aws:imagebuilder:eu-west-2:374269020027:infrastructure-configuration/nomis-rhel-6-10-weblogic-appserver-10-3-0-0-2" -> (known after apply)
        name                             = "nomis_rhel_6_10_weblogic_appserver_10_3"
      ~ platform                         = "Linux" -> (known after apply)
      ~ tags                             = {
          ~ "Weblogic-version"             = "1.1.6" -> "1.1.7"
          - "github-branch"                = "main" -> null
          ~ "image-recipe"                 = "nomis_rhel_6_10_weblogic_appserver_10_3/0.0.2" -> "nomis_rhel_6_10_weblogic_appserver_10_3/0.0.3"
          ~ "infrastructure-configuration" = "nomis_rhel_6_10_weblogic_appserver_10_3/0.0.2" -> "nomis_rhel_6_10_weblogic_appserver_10_3/0.0.3"
            # (10 unchanged elements hidden)
        }
      ~ tags_all                         = {
          ~ "Weblogic-version"             = "1.1.6" -> "1.1.7"
          - "github-branch"                = "main" -> null
          ~ "image-recipe"                 = "nomis_rhel_6_10_weblogic_appserver_10_3/0.0.2" -> "nomis_rhel_6_10_weblogic_appserver_10_3/0.0.3"
          ~ "infrastructure-configuration" = "nomis_rhel_6_10_weblogic_appserver_10_3/0.0.2" -> "nomis_rhel_6_10_weblogic_appserver_10_3/0.0.3"
            # (10 unchanged elements hidden)
        }
        # (4 unchanged attributes hidden)

      ~ image_tests_configuration {
          ~ image_tests_enabled = true -> false
            # (1 unchanged attribute hidden)
        }

      ~ schedule {
          + timezone                           = (known after apply)
            # (2 unchanged attributes hidden)
        }
    }

  # module.imagebuilder["rhel_6_10_weblogic_appserver_10_3"].aws_imagebuilder_image_recipe.this must be replaced
+/- resource "aws_imagebuilder_image_recipe" "this" {
      ~ arn              = "arn:aws:imagebuilder:eu-west-2:374269020027:image-recipe/nomis-rhel-6-10-weblogic-appserver-10-3/0.0.2" -> (known after apply)
      ~ date_created     = "2022-09-13T08:08:20.059Z" -> (known after apply)
      ~ id               = "arn:aws:imagebuilder:eu-west-2:374269020027:image-recipe/nomis-rhel-6-10-weblogic-appserver-10-3/0.0.2" -> (known after apply)
        name             = "nomis_rhel_6_10_weblogic_appserver_10_3"
      ~ owner            = "374269020027" -> (known after apply)
      ~ parent_image     = "ami-0a4fa120054959f61" -> "ami-01ee49d28737b230e" # forces replacement
      ~ platform         = "Linux" -> (known after apply)
      ~ tags             = {
          ~ "Weblogic-version"             = "1.1.6" -> "1.1.7"
          - "github-branch"                = "main" -> null
          ~ "image-recipe"                 = "nomis_rhel_6_10_weblogic_appserver_10_3/0.0.2" -> "nomis_rhel_6_10_weblogic_appserver_10_3/0.0.3"
          ~ "infrastructure-configuration" = "nomis_rhel_6_10_weblogic_appserver_10_3/0.0.2" -> "nomis_rhel_6_10_weblogic_appserver_10_3/0.0.3"
            # (10 unchanged elements hidden)
        }
      ~ tags_all         = {
          ~ "Weblogic-version"             = "1.1.6" -> "1.1.7"
          - "github-branch"                = "main" -> null
          ~ "image-recipe"                 = "nomis_rhel_6_10_weblogic_appserver_10_3/0.0.2" -> "nomis_rhel_6_10_weblogic_appserver_10_3/0.0.3"
          ~ "infrastructure-configuration" = "nomis_rhel_6_10_weblogic_appserver_10_3/0.0.2" -> "nomis_rhel_6_10_weblogic_appserver_10_3/0.0.3"
            # (10 unchanged elements hidden)
        }
      + user_data_base64 = (known after apply)
      ~ version          = "0.0.2" -> "0.0.3" # forces replacement
        # (1 unchanged attribute hidden)

      - block_device_mapping {
          - device_name = "/dev/sda1" -> null
          - no_device   = false -> null

          - ebs {
              - delete_on_termination = "true" -> null
              - encrypted             = "true" -> null
              - iops                  = 0 -> null
              - kms_key_id            = "arn:aws:kms:eu-west-2:374269020027:key/12984197-3371-4c21-8e43-a88a1581e691" -> null
              - throughput            = 0 -> null
              - volume_size           = 30 -> null
              - volume_type           = "gp3" -> null
            }
        }
      + block_device_mapping {
          + device_name = "/dev/sda1"

          + ebs {
              + delete_on_termination = "true"
              + encrypted             = "true"
              + kms_key_id            = "arn:aws:kms:eu-west-2:374269020027:key/12984197-3371-4c21-8e43-a88a1581e691"
              + volume_size           = 30
              + volume_type           = "gp3"
            }
        }
      - block_device_mapping {
          - device_name = "/dev/sdb" -> null
          - no_device   = false -> null

          - ebs {
              - delete_on_termination = "true" -> null
              - encrypted             = "true" -> null
              - iops                  = 0 -> null
              - kms_key_id            = "arn:aws:kms:eu-west-2:374269020027:key/12984197-3371-4c21-8e43-a88a1581e691" -> null
              - throughput            = 0 -> null
              - volume_size           = 150 -> null
              - volume_type           = "gp3" -> null
            }
        }
      + block_device_mapping {
          + device_name = "/dev/sdb"

          + ebs {
              + delete_on_termination = "true"
              + encrypted             = "true"
              + kms_key_id            = "arn:aws:kms:eu-west-2:374269020027:key/12984197-3371-4c21-8e43-a88a1581e691"
              + volume_size           = 150
              + volume_type           = "gp3"
            }
        }

      ~ component {
          ~ component_arn = "arn:aws:imagebuilder:eu-west-2:374269020027:component/weblogic/1.1.6/1" -> (known after apply) # forces replacement
        }

        # (1 unchanged block hidden)
    }

  # module.imagebuilder["rhel_6_10_weblogic_appserver_10_3"].aws_imagebuilder_infrastructure_configuration.this must be replaced
-/+ resource "aws_imagebuilder_infrastructure_configuration" "this" {
      ~ arn                           = "arn:aws:imagebuilder:eu-west-2:374269020027:infrastructure-configuration/nomis-rhel-6-10-weblogic-appserver-10-3-0-0-2" -> (known after apply)
      ~ date_created                  = "2022-09-13T08:08:19.342Z" -> (known after apply)
      ~ date_updated                  = "2022-09-13T09:24:02.053Z" -> (known after apply)
      ~ id                            = "arn:aws:imagebuilder:eu-west-2:374269020027:infrastructure-configuration/nomis-rhel-6-10-weblogic-appserver-10-3-0-0-2" -> (known after apply)
      ~ name                          = "nomis_rhel_6_10_weblogic_appserver_10_3_0_0_2" -> "nomis_rhel_6_10_weblogic_appserver_10_3_0_0_3" # forces replacement
      ~ resource_tags                 = {
          ~ "Weblogic-version"             = "1.1.6" -> "1.1.7"
          - "github-branch"                = "main" -> null
          ~ "image-recipe"                 = "nomis_rhel_6_10_weblogic_appserver_10_3/0.0.2" -> "nomis_rhel_6_10_weblogic_appserver_10_3/0.0.3"
          ~ "infrastructure-configuration" = "nomis_rhel_6_10_weblogic_appserver_10_3/0.0.2" -> "nomis_rhel_6_10_weblogic_appserver_10_3/0.0.3"
            # (10 unchanged elements hidden)
        }
      ~ tags                          = {
          ~ "Weblogic-version"             = "1.1.6" -> "1.1.7"
          - "github-branch"                = "main" -> null
          ~ "image-recipe"                 = "nomis_rhel_6_10_weblogic_appserver_10_3/0.0.2" -> "nomis_rhel_6_10_weblogic_appserver_10_3/0.0.3"
          ~ "infrastructure-configuration" = "nomis_rhel_6_10_weblogic_appserver_10_3/0.0.2" -> "nomis_rhel_6_10_weblogic_appserver_10_3/0.0.3"
            # (10 unchanged elements hidden)
        }
      ~ tags_all                      = {
          ~ "Weblogic-version"             = "1.1.6" -> "1.1.7"
          - "github-branch"                = "main" -> null
          ~ "image-recipe"                 = "nomis_rhel_6_10_weblogic_appserver_10_3/0.0.2" -> "nomis_rhel_6_10_weblogic_appserver_10_3/0.0.3"
          ~ "infrastructure-configuration" = "nomis_rhel_6_10_weblogic_appserver_10_3/0.0.2" -> "nomis_rhel_6_10_weblogic_appserver_10_3/0.0.3"
            # (10 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

Plan: 4 to add, 1 to change, 4 to destroy.

Warning: Experimental feature "module_variable_optional_attrs" is active

  on ../modules/imagebuilder/versions.tf line 2, in terraform:
   2:   experiments = [module_variable_optional_attrs]

Experimental features are subject to breaking changes in future minor or
patch releases, based on feedback.

If you have feedback on the design of this feature, please open a GitHub
issue to discuss it.

```